[{"year":"2015",
"events":
[
    {"title":"Dean's List - AY14/15 Sem II"},
    {"title":"J.P. Morgan Summer Internship",
    "more":"It's classified. 10 weeks duration."},
    {"title":"COMMA II - Project Director",
    "more":"Co-directing with Kendo's chairperson, Samuel. COMMA is abbreviation for Camp Of Multiple Martial Arts. It is open to the school community to learn about different martial arts that have club presence in the school."}
]
},
{"year":"2014",
"events":
[
    {"title":"Team Rookie of the Year - Wushu",
     "more":"It just happened that last year was my first year competing and I got bronze medal by luck."},
    {"title":"NUS Wushu Captain and Chairperson",
     "date":"Mid 2014 - Mid 2015",
     "more":"There is a difference between the two. Captain leads the team on competition basis, while chairperson leads the club on recreational and any other basis. Quite difficult, especially that I was the first one after so many years of the two positions being split. It gave me good experience of what is expected on being a leader, though. Probably the craziest decision I have ever made since I can't speak Chinese."},
    {"title":"Autodesk 6-month Industrial Attachment",
     "more":"Checkout my LinkedIn for the details!"},
    {"title":"NUS Wushu Vice Captain (Sem 2)",
     "more":"In sem 2, the vice captain went on some exchange programme. Thus, I was asked to move position from secretary to vice captain."}
]},
{"year":"2013",
"events":
[
    {"title":"NUS Wushu Secretary (Sem 1)"},
    {"title":"Global Game Jam Participant",
     "more":"Initially, I joined to do simple art work since I am not that good in drawing, anyways, but my programming skill was lacking. However, due to manpower shortage on programming and I was able to understand the code little by little, I helped the team in programming the collision detection. Just a basic one, though, no fancy optimization."}
]},
{"year":"2012",
"events":
[
    {"title":"NUS Wushu Club Member"},
    {"title":"NUS Game Development Group Member"},
    {"title":"6 Distinctions in GCE A-level 2011",
     "more":"Project Work (PW), Math, Physics, Chemistry, Economics, H3 Physics - Semiconductor. I have proven once again that the hardest thing to get an A for me is language."},
    {"title":"Top A-Level Physics | Gold Award",
     "more":"Well, kind of unexpected. I never really got best Physics score in JC. Only 96th to 98th percentile. I expected my Vietnamese friend who has been getting top Physics score in the past two years to get it. He told me that he also has his finger crossed. When they announced my name, I was surprised! And my friend (if you see top physics entry in year 2009) decided to put an end to argue who is the best in Physics (again, in good fun; me and him are good buddies). Too bad I decided on a different path.<br/>Oh, in case you are wondering, the award means I scored top for National A-level Physics examination. Gold Award means I got 98th Percentile nationally. In the end, the Institute of Physics Singapore never gave out the reward; don't ask me why since at some point in time my email just stopped being replied. But there were 5 recipients for my year, if I am not mistaken from some news by someone."}
]},
{"year":"2011",
"events":
[
    {"title":"Photography Club - Digital Manager",
    "date":"the first half of the year"},
    {"title":"Orientation Group Leader (OGL)",
     "more":"I am an introvert person, but I tried to train myself as extrovert person in case needed for work purposes. This was one of the way I tried to train myself; dancing in the public, cheering, leading a group. Try many things when you are young, right?"}
]},
{"year":"2010",
"events":
[
    {"title":"Scholastic Merit Award (Top Student - Promotional Exam)"},
    {"title":"Singapore Chemistry Olympiad (SChO) | Participation",
    "more":"Well, I didn't expect to do well, anyway. Chemistry was not my forte. I was asked to join because I was one of the top scorers for Chemistry in the promotional exam, which was a luck by itself. I originally intended to join Physics Olympiad instead, but it was freaking hard and when the filtering test at school was conducted, I was lazy to go since my friend overslept and decided not to go. Well, good knowledge :)"},
    {"title":"CREATE2011 Challenge (Senior Category) | Champion",
    "date":"2010, JC1. Named 2011 since it was a future engineering challenge",
    "more":"Initially I registered to get free Shrek movie screening during the registration, but I told my two buddies we gotta join the competition, for the sake of fun. Supposedly, winning only gives us cash and trip to China sponsored by Nokia. Surprisingly, NOKIA GAVE US N8 WHEN IT WAS NOT EVEN RELEASED IN SINGAPORE!!! I felt so lucky! Good experience, good reward."},
    {"title":"Mission Maker - Game Making Competition | Participation",
    "more":"We were supposed to make a game using a propietary software which was quite restricted in terms of functionalities. Since me and my buddies are the same team for this competition and CREATE2011, we decided to divide the workload: one of my buddies work solo on this while the two of us work for the other. Well, we didn't win this one, but winning CREATE2011 was certainly more rewarding ^.^"},
    {"title":"Study Trip to University of Southampton, School of Electronics and Computer Science",
    "more":"Another spark for electronics and CS in me. It was a good trip, but the most memorable thing was that we were asked to hack cleaning robot like roomba to follow a ball seen in its camera, and that was something that I found revolutionary at that time."},
    {"title":"Photography Club - Digital Manager",
    "date":"the last half of the year",
    "more":"Worked mainly on archiving and distributing photos."}
]},
{"year":"2009",
"events":
[
    {"title":"1st Physics for Preliminary Examination",
     "date":"Secondary 4",
     "more":"Kind of no surprise at this point in time. I got full mark for term 1 test, top 5 or so for mid year test. It was unexpected, though, since I didn't get highest for mid year test, which materials were virtually the same as preliminary examination. My friend kept arguing with me about who should be the best in Physics about this exam for about the next 2 years, until I got another award. Good fun, though."},
    {"title":"1st Elementary Mathematics for Preliminary Examination",
     "date":"Secondary 4"},
    {"title":"Micromouse Club - Executive Committee Member",
     "more":"Was added by my nice teacher at the last minute because I worked quite hard in the club."},
    {"title":"Environment Club - Vice President",
     "more":"Originally, I was secretary. My teacher told me I did more job than just the secretary, so she registered me as second vice president."},
    {"title":"Inter-School Micromouse Competition (ISMC) (Open) | 2nd Runner Up",
     "more":"Done in team. We lost because of budget; our mouse lost in terms of machinery compared to other schools. That is the fact of life: no matter how good you are, sometimes money wins. And that life is unfair, so don't complain."},
    {"title":"Australian Mathematics Competition - Distinction"},
    {"title":"Competition and Assessment for Schools - Science | Credit"},
    {"title":"Singapore Junior Physics Olympiad (Open) (SJPO) | Honourable Mention",
     "more":"Well, I was not in the special classes in the school. Only people from those special classes were allowed to join the olympiad. The teacher in charge asked my friend (who is from the special classes) to ask around our Indonesian circle if anyone is interested, though again must be from the special classes. I asked him to ask the teacher if I can be given special permission to join as I got top physics in the last exam. And I got in! Was quite happy, although I must say the olympiad was out of my league. Good experience, though. And good escape from love life."}
]},
{"year":"2008",
"events":
[
    {"title":"3R Award Competition",
    "more":"Environment Club's effort. If I am not mistaken, we were supposed to make some edutainment application about climate change and 3R (Reuse, Reduce, Recycle) efforts on any areas. We reused information we got from Panasonic 3R efforts in Clean and Green Singapore Schools' Carnival and made it into a game about awareness on different TVs and refrigerators - efficiencies and other stuffs about them. Of course, Panasonic was fully aware about us using the information from them for this competition as well as the two events were concurrent."},
    {"title":"NEA Green Audit - LOTUS Award",
    "more":"Environment Club's effort in keeping the school compound green, i.e. complience with 3R (Reuse, Reduce, Recycle) efforts and other green initiatives."},
    {"title":"Clean and Green Singapore Schools' Carnival",
    "more":"Environment club's effort in learning clean and green living. Was done in collaboration with Panasonic. Had the chance to learn Panasonic's 3R (Reuse, Reduce, Recycle) methods and factory visit."},
    {"title":"1st Physics for Promotional Examination",
    "date":"Secondary 3",
    "more":"Didn't expect this at all. If it was math, yeah sure since I do double checking most of the time. Physics? Surprise! Apparently, this was just a start, though this is not the path I chose in the end."},
    {"title":"Outward Bound Singapore (OBS)",
    "more":"Kind of a big deal when you are in Secondary school, though I found Indonesia's boy scout camp just as challenging, except that there was no exploration."},
    {"title":"Environment Club - Secretary",
    "date":"Secondary 3"},
    {"title":"Inter-School Micromouse Competition (ISMC) (Open) | Champion",
    "date":"Secondary 3"},
    {"title":"Learn@1&deg; North - Climate Challenge and Herald",
    "more":"Sent off to the competition from school's Environment Club. Quite a fun game day for learning climate change and learning blog writing."},
    {"title":"Competition and Assessment for Schools - Science | Credit"},
    {"title":"Competition and Assessment for Schools - English | Participation"}
]},
{"year":"2007",
"events":
[
    {"title":"St. Joseph's Institution (SJI) School-based Scholarship",
    "more":"Got scholarship to continue my study in Singapore! ^.^ I will have 2 years delay compared to my batch, though, since I need to repeat Secondary 3. Singapore has 4-year secondary and 2-year pre-U while Indonesia has 3-year secondary and 3-year pre-U, hence I need to repeat sec 3 in Singapore since they don't want us to go in 1 year then take O-level, the national exam. The other 1 year delay comes from difference in curriculum year; Singapore starts at Jan and Indonesia starts at July, hence I lost half a year waiting to enter secondary school and another half from waiting for University since uni starts on July.<br/> I would say it's worth it, though, for my personal development."},
    {"title":"Yamaha Electone Grade 6",
    "more":"Woohoo! I stopped continuing as well as per reason for my grade 6 Piano."}
]},
{"year":"2006",
"events":
[
    {"title":"Yamaha Piano Pop Grade 6",
    "more":"Finally! Grade in Yamaha goes down from 13 to 1, so if counted from 1, I am grade 8. At this point, I stopped joining the next course because they said that they won't let you pass grade 5 unless you are very talented or you are above 17 years old (as if grade 5 qualification is intoxicating, yeah?). Reason being grade 5 qualification allows you to teach the course, and they don't want kids to teach."},
    {"title":"Christmas Eve Mass - Organist",
    "date":"24 December 2006",
    "more":"Surprise! My club teacher (who is also the teacher for Religion subject at school) asked for the Christmas Eve Mass at school to have organists instead of only the regular wind ensemble."},
    {"title":"Easter Mass - Choir",
    "more":"I didn't join school choir, but I joined school organist club. The club only help you to practice to be a church organist, but you will not be asked to be the organist for big event masses at school (like Christmas and Easter), which are open to public. As such, my club teacher asked me to join the choir for Easter service instead."}
]},
{"year":"2005",
"events":
[
    {"title":"Inter-school Sport Competition - Committee Member",
    "more":"I remember this year I joined under Publicity, taking pictures of events. You know, taking pictures and stuffs. And being in boys school, i.e. always on the lookout for pretty ladies, the publicity division has pictures of the pretty ladies."},
    {"title":"Student Committee Trainee",
    "more":"Joined trainee program for student committee. I didn't get to be student committee, though. And I would like to focus my 3rd year on study for national exam so I didn't accept the automatic offer in the next year."}
]},
{"year":"2004",
"events":
[
    {"title":"Inter-school Sport Competition - Committee Member",
    "more":"Can't remember which division. First year in secondary school."},
    {"title":"Highest Score School Final Exam - Religion",
    "more":"Another surprise for everyone. That most polite kid got highest for religion subject in Primary 6 final exam. My friends, my family and I had another good laugh. It was unexpected, though, since my mom expected me to get highest for math or science, which I only came close to the highest."},
    {"title":"Most Polite Student",
    "more":"Unexpected much. It was farewell camp for Primary 6 kids, and I received the award. My friends laughed at me, because they know who is the true me :p"},
    {"title":"Science and Math Competition",
    "more":"I was runner-up for district level. The top 3 for the district then went to regional level, at which we got thrashed."},
    {"title":"Yamaha Music Festival",
    "more":"This year, I participated in Electone (Junior Category) and Ensemble (Open Category). We were champion for district level again!"}
]},
{"year":"2003",
"events":
[
    {"title":"Yamaha Music Festival",
    "more":"This year, I participated in Piano (Junior Category) and Ensemble (Open Category) for district level. I didn't win anything, though :( I didn't expect to get anything for piano solo, but for ensemble, the competition was tough."}
]},
{"year":"2002",
"events":
[
    {"title":"Yamaha Music Festival",
    "more":"Our music ensemble group was champion for district, regional and provincial level. We were supposed to be guest performance in Thailand for the higher level (I think ASEAN), but due to some epidemy (can't remember what), it was cancelled :("}
]},
{"year":"1992",
"events":
[
    {"title":"Born!"}
]}
]
